bolknote/MK61S_MINI/code/tools.cpp
bool Rename(usize nSlot, char* slot_name) {
  char old_name[8];
  snprintf(old_name, sizeof(old_name), "%u", (unsigned) nSlot);
  return program_store::rename(program_store::ProgramType::MK61, old_name, slot_name);
}

bool DeleteSlot(usize nSlot) {
  if(nSlot > MAX_SLOT_FOR_PROGRAM) return false;
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return program_store::remove(program_store::ProgramType::MK61, name);
}

bool StoreProgram(const char* name) {
  return StoreProgram(program_store::ROOT_ID, name);
}

bool StoreProgram(u16 parent_id, const char* name) {
  if(check_empty_program()) return false; // error
  if(name == NULL || name[0] == 0) return false;

  shared_scratch::Lease scratch(shared_scratch::Owner::M61_FORMAT, program_store::MAX_MK61_TEXT_SIZE);
  if(!scratch.ok()) return false;
  u8* script_buffer = scratch.data();
  u16 script_len = 0;
  if(!m61_text::format_current_program(script_buffer, scratch.size(), &script_len)) return false;
  if(!program_store::write_file(parent_id, program_store::INVALID_ID,
                                program_store::ProgramType::MK61, name,
                                script_buffer, script_len, NULL)) return false;

  dbg(MINI, "\nProgramm saved!");
  return true;
}

bool Store(usize nSlot) {
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return StoreProgram(name);
}

bool Store(void) {
  {
    MK61DisplayUpdate update(lcd);
    lcd.clear(); lcd.setCursor(0, 0);
  }

  if(check_empty_program()) return false; // error

  isize address;
  {
    MK61DisplayUpdate update(lcd);
    library_mk61::print_localized_at(0, 0, "ПИС ", "Save ", 5); //lcd.setCursor(7, 0);
    address = calc_address();
  }
  if(address < 0) return false; // error

  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) (address / FLASH_SECTOR_SIZE));
  if(program_store::exists(program_store::ProgramType::MK61, name)) {
    #ifdef DEBUG_SPIFLASH
      Serial.print("SPIFLASH: SLOT IS OCCUPIED ");
      Serial.println(address);
    #endif
    sound(PIN_BUZZER, 4000, 750, library_mk61::sound_volume());
    {
      MK61DisplayUpdate update(lcd);
      lcd.setCursor(0, 0); lcd.print(library_mk61::text("OVER", "OVER")); lcd.setCursor(8, 0); lcd.print(library_mk61::text("press OK", "OK?"));
    }
    if(kbd::get_key_wait() != KEY_OK) return false; // error
  }

  #ifdef DEBUG_SPIFLASH
    Serial.print("SPIFLASH: write to address ");
    Serial.println(address);
  #endif

  #ifdef DEBUG_SPIFLASH
    Serial.print("SPIFLASH: erase sector...");
  #endif
  u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  core_61::get_code_page(&code_page[0]);
  const usize code_len = seek_program_END(&code_page[0]);

  shared_scratch::Lease scratch(shared_scratch::Owner::M61_FORMAT, program_store::MAX_MK61_TEXT_SIZE);
  if(!scratch.ok()) return false;
  u8* script_buffer = scratch.data();
  u16 script_len = 0;
  if(!m61_text::format_current_program(script_buffer, scratch.size(), &script_len)) return false;

  #ifdef SERIAL_OUTPUT
    Serial.print("Save ");
  #endif

  for(usize i = 0; i < code_len; i++){
    #ifdef SERIAL_OUTPUT
      Serial.write('#');
    #endif
    const u8 x = i / BLOCK_SIZE;
    {
      MK61DisplayUpdate update(lcd);
      lcd.setCursor(x, 1); lcd.print((char) 0xFF); lcd.print(i);
    }
  }
  if(!program_store::write_mk61(name, script_buffer, script_len)) return false;

  #ifdef SERIAL_OUTPUT
    Serial.println("\nProgramm saved!");
  #endif
  return true;
}              

using namespace action;

bool  EraseFlash(void) {
  sound(PIN_BUZZER, 4000, 750, library_mk61::sound_volume());
  {
    MK61DisplayUpdate update(lcd);
    lcd.setCursor(0, 0); lcd.print(library_mk61::text("press OK ERASED!", "OK CTEP FLASH"));
  }
  if(kbd::get_key_wait() != KEY_OK) return action::MENU_BACK;
 // стираем внешний флеш
  {
    MK61DisplayUpdate update(lcd);
    lcd.clear(); lcd.setCursor(0, 0); lcd.print(library_mk61::text("Erase slot ", "CTEP SLOT "));
  }
  if(!program_store::format()) {
    message_and_waitkey(library_mk61::text("Flash error", "FLASH ERROR"));
    return action::MENU_BACK;
  }
  {
    MK61DisplayUpdate update(lcd);
    lcd.clear(); lcd.setCursor(0, 0); lcd.print(library_mk61::text("Erase settings", "CTEP SETUP"));
  }
  bool settings_reset_ok = true;
  if(flash_is_ok) settings_reset_ok = program_store::erase_settings();
  reset_persistent_settings_cache();
  if(settings_reset_ok) write_persistent_settings();
  library_mk61::load_settings_state();
  lcd.setTextProfile(library_mk61::display_text_profile());
  sound(PIN_BUZZER, 1000, 300, library_mk61::sound_volume());
  message_and_waitkey(library_mk61::text(" press any key! ", "   OK/KEY     "));
  return action::MENU_EXIT;
}
